snlkuharlocal/src/InformationRegisters/ТокеныАвторизацииИСМП/ТокеныАвторизацииИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТокеныАвторизацииИСМП</name>
  <resources>
    <name>Токен</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтпечатокЭЦП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаБлокировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипТокена</name>
    <comment>СУЗ, TrueAPI</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СУЗ</name>
    <type>
      <types>CatalogRef.СтанцииУправленияЗаказамиИСМП</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/CommonModules/ОбменСЧЗЧерезОУКЭПСервер/Module.bsl
Функция ПолучитьСписокСертификатовСИНН()  Экспорт
	Менеджер	= Новый МенеджерКриптографии("Crypto-Pro GOST R 34.10-2012 Cryptographic Service Provider","",80);
	Хранилище 	= Менеджер.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
	
	СписокСертификатов = Новый СписокЗначений;
	Для Каждого Сертификат Из Хранилище.ПолучитьВсе() Цикл		
		Если Сертификат.ИспользоватьДляПодписи И Сертификат.ДатаОкончания>=НачалоДня(ТекущаяДата()) Тогда
			Наименование = 	""+ ПолучитьЗначениеПараметра(Сертификат.Субъект, "OID1_2_643_100_4");
			СписокСертификатов.Добавить(ДвоичныеДанныевHEX(Сертификат.Отпечаток), Наименование);
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат СписокСертификатов;
КонецФункции

Функция ПолучитьЗначениеПараметра(СтруктураПараметров,Имя,ЗначениеПоУмолчанию=Неопределено) 
	Возврат МаркировкаКС.ПолучитьЗначениеПараметра(СтруктураПараметров, Имя, ЗначениеПоУмолчанию);
КонецФункции

Функция ДвоичныеДанныевHEX(Данные) 
	Результат = "";
	
	КодыХЕКС = СтрРазделить("0,1,2,3,4,5,6,7,8,9,A,B,C,D,E,F", ",");
	
	ЧтениеДанных = Новый ЧтениеДанных(Данные);		
	Байт = ЧтениеДанных.ПрочитатьБайт();		
	Пока Байт <> Неопределено Цикл        	
		H 	= Цел(Байт / 16);
		L	= Байт % 16;
		
		Результат = Результат+КодыХЕКС[H]+КодыХЕКС[L];		
		Байт = ЧтениеДанных.ПрочитатьБайт();
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьТокенTrueApi() Экспорт
	Токен_TrueApi = неопределено; 
	Сертификаты = ПолучитьСписокСертификатовСИНН(); 
	
	ОтработаноПоСтанцииУспешно = Ложь; 
	Для Каждого Серт Из Сертификаты Цикл  
		
		 
		Токен_TrueApi_Данные = РегистрыСведений.ТокеныАвторизацииИСМП.ПолучитьТокен("TrueApi", Справочники.Организации.НайтиПоКоду("SS-001"), Серт.Значение);
		
		Если Токен_TrueApi_Данные.Успешно// Тогда
			// Ихсанов Д. А. Начало 31.03.2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-9280
			И ЗначениеЗаполнено(Токен_TrueApi_Данные.Данные.Токен)
			И Токен_TrueApi_Данные.Данные.Токен <> "0" Тогда
			// Ихсанов Д. А. Конец  31.03.2026
			
			Токен_TrueApi = Токен_TrueApi_Данные.Данные.Токен; 	
			Прервать; 
		Иначе 
			
			ЗаписатьВЛог("Получение информации КМ","Не найден токен api","Ошибка");
			 
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат Токен_TrueApi; 

КонецФункции // ПолучитьТокенTrueApi()
//Данилова Е.В. 24.04.2026 HELP-9550
Функция ПроверитьМаркиЧЗНаСервере(Знач МассивКМ,АдресРезультата = неопределено) Экспорт

	ОбработкаАПи 		= Обработки.АпиЧЗ.Создать(); 
	//Данилова Е.В. 24.04.2026 HELP-9550 добавлен параметр
	РезультатОтработки  = ОбработкаАПи.ПолучитьДанныеИзЧЗПоКодамКМ(МассивКМ,АдресРезультата);
	
	Возврат РезультатОтработки; 

КонецФункции // ПроверитьМаркиЧЗНаСервере()

Функция ПолучитьСертификатЭЦП_ОУКЭП(Знач Организация = Неопределено) Экспорт
	Результат = "";
	Если Организация = Неопределено Тогда
		Организация = Маркировка_ПИ.ОрганизацияЕЕЭ();	
	КонецЕсли;
	
	ИНН = СокрЛП(ПолучитьРеквизитШапки(Организация, "ИНН"));
		
	ДанныеСертификатов = ПолучитьСписокСертификатовСИНН();
	
	Для Каждого Элемент Из ДанныеСертификатов Цикл                   
		Если СокрЛП(Элемент.Представление) = ИНН Тогда
			Результат = Элемент.Значение;		
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Результат;
КонецФункции //ПолучитьСертификатЭЦП_ОУКЭП(Знач Организация = Неопределено) Экспорт
